{
  "format": "layers-model",
  "generatedBy": "simple_convert.py",
  "convertedBy": "TensorFlow.js Converter",
  "modelTopology": {
    "keras_version": "2.15.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                128,
                128,
                3
              ],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "input_1"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_1",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "groups": 1,
              "activation": "relu",
              "use_bias": true
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_1",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [
                2,
                2
              ],
              "padding": "valid",
              "strides": [
                2,
                2
              ],
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_2",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "groups": 1,
              "activation": "relu",
              "use_bias": true
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_2",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [
                2,
                2
              ],
              "padding": "valid",
              "strides": [
                2,
                2
              ],
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Flatten",
            "config": {
              "name": "flatten",
              "trainable": true,
              "dtype": "float32",
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 256,
              "activation": "relu",
              "use_bias": true
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "trainable": true,
              "dtype": "float32",
              "units": 38,
              "activation": "softmax",
              "use_bias": true
            }
          }
        ]
      }
    },
    "training_config": {
      "loss": "categorical_crossentropy",
      "metrics": [
        "accuracy"
      ],
      "weighted_metrics": null,
      "loss_weights": null,
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "name": "Adam",
          "learning_rate": 0.0001
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "weights/conv1_kernel.bin",
        "weights/conv1_bias.bin",
        "weights/conv2_kernel.bin",
        "weights/conv2_bias.bin",
        "weights/dense1_kernel.bin",
        "weights/dense1_bias.bin",
        "weights/dense2_kernel.bin",
        "weights/dense2_bias.bin"
      ],
      "weights": [
        {
          "name": "conv2d_1/kernel",
          "shape": [
            3,
            3,
            3,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_1/bias",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_2/kernel",
          "shape": [
            3,
            3,
            32,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_2/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/kernel",
          "shape": [
            65536,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/kernel",
          "shape": [
            256,
            38
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/bias",
          "shape": [
            38
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}